app/Controllers/CourseController.php

UPDATE `courses` SET `course_name` = 'Pengantar Rekayasa Perangkat Lunak ', `credits` = '3', `updated_at` = '2025-09-16 06:39:17'
WHERE `courses`.`course_id` IN ('5')
---
    public function update()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied');
        }

        $courseId = $this->request->getPost('course_id');

        if (!$courseId) {
            return redirect()->back()->with('error', 'Invalid course ID');
        }

        $validation = \Config\Services::validation();
        $validation->setRules([
            'course_name' => 'required|min_length[3]|max_length[100]',
            'credits' => 'required|integer|greater_than[0]|less_than_equal_to[6]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('error', 'Invalid input data')->withInput();
        }

        try {
            $data = [
                'course_name' => $this->request->getPost('course_name'),
                'credits' => $this->request->getPost('credits')
            ];

            if ($this->courseModel->update($courseId, $data)) {

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '5'
---
    public function enroll($courseId)
    {
        if (session()->get('role') !== 'student') {
            return redirect()->to('/dashboard')->with('error', 'Access denied');
        }

        if (!$courseId || !is_numeric($courseId)) {
            return redirect()->to('/courses')->with('error', 'Invalid course ID');
        }

        try {
            $studentId = session()->get('user_id');

            $course = $this->courseModel->find($courseId);

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '13'
---
    public function enrollMultiple()
    {
        if (session()->get('role') !== 'student') {
            return redirect()->to('/dashboard')->with('error', 'Access denied');
        }

        $courseIds = $this->request->getPost('course_ids');
        if (!is_array($courseIds) || empty($courseIds)) {
            return redirect()->to('/courses')->with('error', 'Pilih setidaknya satu mata kuliah');
        }

        try {
            $studentId = session()->get('user_id');
            $currentCredits = $this->courseModel->getStudentTotalCredits($studentId);
            $newCredits = 0;

            foreach ($courseIds as $courseId) {
                $course = $this->courseModel->find($courseId);