app/Controllers/StudentController.php

        }

        try {
            $existingStudent = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '21'