app/Models/CourseModel.php

SELECT *
FROM `courses`
ORDER BY `course_name` ASC
---
    public function getAllCourses()
    {
        return $this->orderBy('course_name', 'ASC')->findAll();

INSERT INTO `takes` (`student_id`, `course_id`, `enroll_date`) VALUES ('11', '5', '2025-09-16')
---
    public function enroll($studentId, $courseId)
    {
        try {
            $data = [
                'student_id' => $studentId,
                'course_id' => $courseId,
                'enroll_date' => date('Y-m-d H:i:s')
            ];
            return $this->db->table('takes')->insert($data);

SELECT COUNT(*) AS `numrows`
FROM `takes`
WHERE `student_id` = '11'
AND `course_id` = '5'
---
    public function isStudentEnrolled($studentId, $courseId)
    {
        $result = $this->db->table('takes')
            ->where('student_id', $studentId)
            ->where('course_id', $courseId)
            ->countAllResults();

SELECT `courses`.`course_id`, `courses`.`course_name`, `courses`.`credits`, `takes`.`enroll_date`
FROM `takes`
JOIN `courses` ON `courses`.`course_id` = `takes`.`course_id`
WHERE `takes`.`student_id` = '17'
ORDER BY `takes`.`enroll_date` DESC
---
    public function getEnrolledCourses($studentId)
    {
        return $this->db->table('takes')
            ->select('courses.course_id, courses.course_name, courses.credits, takes.enroll_date')
            ->join('courses', 'courses.course_id = takes.course_id')
            ->where('takes.student_id', $studentId)
            ->orderBy('takes.enroll_date', 'DESC')
            ->get()
            ->getResultArray();

SELECT SUM(courses.credits) as total_credits
FROM `takes`
JOIN `courses` ON `courses`.`course_id` = `takes`.`course_id`
WHERE `takes`.`student_id` = '17'
---
    public function getStudentTotalCredits($studentId)
    {
        $result = $this->db->table('takes')
            ->select('SUM(courses.credits) as total_credits')
            ->join('courses', 'courses.course_id = takes.course_id')
            ->where('takes.student_id', $studentId)
            ->get()
            ->getRowArray();

INSERT INTO `takes` (`student_id`, `course_id`, `enroll_date`) VALUES ('17', '13', '2025-09-23 16:33:41')
---
    public function enrollMultiple($studentId, $courseIds)
    {
        if (!is_array($courseIds) || empty($courseIds)) {
            return false;
        }

        try {
            $this->db->transStart();
            $successCount = 0;

            foreach ($courseIds as $courseId) {
                if (!$this->isStudentEnrolled($studentId, $courseId)) {
                    $data = [
                        'student_id' => $studentId,
                        'course_id' => $courseId,
                        'enroll_date' => date('Y-m-d H:i:s')
                    ];
                    if ($this->db->table('takes')->insert($data)) {