app/Models/userModel.php

    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'suci@student.com'
 LIMIT 1

    public function getStudentById($userId)
    {
        return $this->db->table('users')
            ->select('users.*, students.entry_year')
            ->join('students', 'students.student_id = users.user_id', 'inner')
            ->where('users.user_id', $userId)
            ->where('users.role', 'student')
            ->get()
            ->getRowArray();
---
SELECT `users`.*, `students`.`entry_year`
FROM `users`
INNER JOIN `students` ON `students`.`student_id` = `users`.`user_id`
WHERE `users`.`user_id` = '21'
AND `users`.`role` = 'student'

    public function getStudents()
    {
        return $this->db->table('users')
            ->select('users.*, students.entry_year')
            ->join('students', 'students.student_id = users.user_id', 'inner')
            ->where('users.role', 'student')
            ->orderBy('users.full_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `users`.*, `students`.`entry_year`
FROM `users`
INNER JOIN `students` ON `students`.`student_id` = `users`.`user_id`
WHERE `users`.`role` = 'student'
ORDER BY `users`.`full_name` ASC

    public function updateStudent($userId, $userData, $studentData = null)
    {
        $this->db->transStart();

        try {

            if (isset($userData['password']) && !empty($userData['password'])) {
                $userData['password'] = password_hash($userData['password'], PASSWORD_DEFAULT);
            } else {

                unset($userData['password']);
            }


            $this->skipValidation(true);

            // Update tabel users
            if (!$this->update($userId, $userData, false)) {
                throw new \Exception('Failed to update user: ' . implode(', ', $this->errors()));
            }


            if ($studentData && is_array($studentData)) {
                if (!$this->db->table('students')->where('student_id', $userId)->update($studentData)) {
---
UPDATE `users` SET `username` = 'haechan', `email` = 'jkhcn976@gmail.com', `full_name` = 'haechan haechan', `updated_at` = '2025-09-23 17:00:03'
WHERE `users`.`user_id` IN ('21')
UPDATE `students` SET `entry_year` = '2022'
WHERE `student_id` = '21'